Peyton-Chen/Music-Reminder/TM4C1294XL端/Music_Reminder/TFTinit/TFT_400x240_OTM4001A_16bit.c
/*
 * TFT_400x240_OTM4001A_16bit.c
 *
 *  Created on: 2014年8月26日
 *      Author: Sam
 */

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_gpio.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/gpio.h"
#include "driverlib/epi.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h"
#include "driverlib/rom.h"
#include "grlib/grlib.h"
#include "inc/tm4c1294ncpdt.h"
#include "TFT_400x240_OTM4001A_16bit.h"
#include "font.h"
#include "EPIinit/EPIinit.h"
#include "picture.h"


//
// LCD control line GPIO definitions.
//

#define LCD_CS_PERIPH              SYSCTL_PERIPH_GPIOE
#define LCD_CS_BASE                GPIO_PORTE_BASE
#define LCD_CS_PIN                 GPIO_PIN_1
#define LCD_CS_PIN_REG               0x40024008
#define LCD_RESET_PERIPH           SYSCTL_PERIPH_GPIOF
#define LCD_RESET_BASE             GPIO_PORTF_BASE
#define LCD_RESET_PIN              GPIO_PIN_4
#define LCD_RESET_PIN_REG            0x40025040
#define LCD_RS_PERIPH              SYSCTL_PERIPH_GPIOP
#define LCD_RS_BASE                GPIO_PORTP_BASE
#define LCD_RS_PIN                 GPIO_PIN_5
#define LCD_RS_PIN_REG               0x40065080
#define LCD_IM0_PERIPH             SYSCTL_PERIPH_GPIOL
#define LCD_IM0_BASE               GPIO_PORTL_BASE
#define LCD_IM0_PIN                GPIO_PIN_5
#define LCD_IM0_PIN_REG              0x40062080
#define LCD_WR_PERIPH              SYSCTL_PERIPH_GPIOE
#define LCD_WR_BASE                GPIO_PORTE_BASE
#define LCD_WR_PIN                 GPIO_PIN_2
#define LCD_WR_PIN_REG               0x40024010
#define LCD_RD_PERIPH              SYSCTL_PERIPH_GPIOE
#define LCD_RD_BASE                GPIO_PORTE_BASE
#define LCD_RD_PIN                 GPIO_PIN_0
#define LCD_RD_PIN_REG               0x40024004

//*****************************************************************************
//
// define TFTLCD_ADDR to use EPI HB16 mode to driver TFTLCD
//
#define TFTLCD_ADDR	  *(unsigned short *)0xA0000000

#define LCD_VERTICAL_MAX 400
#define LCD_HORIZONTAL_MAX 240


//*****************************************************************************
//
// Function pointer types for low level LCD controller access functions.
//
//*****************************************************************************
typedef void (*pfnWriteData)(uint16_t ui16Data);
typedef void (*pfnWriteCommand)(uint16_t ui8Data);

//*****************************************************************************
//
// Function pointers for low level LCD controller access functions.
//
//*****************************************************************************

static void WriteDataGPIO(uint16_t ui16Data);
static void WriteCommandGPIO(uint16_t ui16Data);

pfnWriteData WriteData = WriteDataGPIO;
pfnWriteCommand WriteCommand = WriteCommandGPIO;

//*****************************************************************************
//
// Writes a data word to the SSD1306.  This function implements the basic GPIO
// interface to the LCD display.
//
//*****************************************************************************

static void
WriteDataGPIO(uint16_t ui16Data)
{
    //
    // Write the most significant byte of the data to the bus.
    //
	TFTLCD_ADDR = 0;
//    SysCtlDelay(3);
    //
    // Pull RS High.
    //
    HWREG(LCD_RS_PIN_REG) = 0xFF;
    SysCtlDelay(1);
    //
    // Pull CS Low.
    //
    HWREG(LCD_CS_PIN_REG) = 0;
    //
    // Pull RD High.
    //
//    HWREG(LCD_RD_PIN_REG) = 0xFF;

//    SysCtlDelay(3);

    //
    // Assert the write enable signal.
    // Delay for at least 60nS (at 120 Mhz) to meet Display timing.
    //
    HWREG(LCD_WR_PIN_REG) = 0;
    //
    // Write the least significant byte of the data to the bus.
    //
    TFTLCD_ADDR = ui16Data;
//    SysCtlDelay(4);

    SysCtlDelay(3);
    //
    // Deassert the write enable signal.
    //
    HWREG(LCD_WR_PIN_REG) = 0xFF;
//    SysCtlDelay(1);

    //
    // Deassert the chip select pin.
    //
    HWREG(LCD_CS_PIN_REG) = 0xFF;
    SysCtlDelay(3);
}

//*****************************************************************************
//
// Writes a command to the SSD2119.  This function implements the basic GPIO
// interface to the LCD display.
//
//*****************************************************************************

static void
WriteCommandGPIO(uint16_t ui16Data)
{
    //
    // Write the most significant byte of the data to the bus. This is always
    // 0 since commands are no more than 8 bits currently.
    //
//	TFTLCD_ADDR = 0;
//    SysCtlDelay(3);
    //
    // Pull RS Low.
    //
    HWREG(LCD_RS_PIN_REG) = 0;
        SysCtlDelay(1);
    //
    // Pull CS Low.
    //
    HWREG(LCD_CS_PIN_REG) = 0;
    //
    // Pull RD High.
    //
//    HWREG(LCD_RD_PIN_REG) = 0xFF;
    // Assert the write enable signal.
    // Delay for at least 60nS (at 120 Mhz) to meet Display timing.
    //
    HWREG(LCD_WR_PIN_REG) = 0;

    //
    // Write the least significant byte of the data to the bus.
    //
	TFTLCD_ADDR = ui16Data;

//    SysCtlDelay(3);

    SysCtlDelay(3);
    //
    // Deassert the write enable signals.  Make sure we add padding here
    // too since some compilers inline this function.
    //
    HWREG(LCD_WR_PIN_REG) = 0xFF;
//    SysCtlDelay(1);

    HWREG(LCD_CS_PIN_REG) = 0xFF;
    SysCtlDelay(3);
}







//*****************************************************************************
//
// Initializes the pins required for the GPIO-based LCD interface.
//
// This function configures the GPIO pins used to control the LCD display
// when the basic GPIO interface is in use.  On exit, the LCD controller
// has been reset and is ready to receive command and data writes.
//
// \return None.
//
//*****************************************************************************
void
InitGPIOLCDInterface(uint32_t ui32ClockMS)
{
    //
    // Configure the pins that connect to the LCD as GPIO outputs.
    //
    SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOB);//
    SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOC);//
    SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOE);//
    SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOF);//
    SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOK);//
    SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOM);//
    SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPION);//
    SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOP);//
    SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOL);//

    GPIOPinTypeGPIOOutput(LCD_CS_BASE, LCD_CS_PIN);
    GPIOPinTypeGPIOOutput(LCD_RESET_BASE, LCD_RESET_PIN);
    GPIOPinTypeGPIOOutput(LCD_RS_BASE, LCD_RS_PIN);
    GPIOPinTypeGPIOOutput(LCD_IM0_BASE, LCD_IM0_PIN);
    GPIOPinTypeGPIOOutput(LCD_WR_BASE, LCD_WR_PIN);
    GPIOPinTypeGPIOOutput(LCD_RD_BASE, LCD_RD_PIN);

    //
    // Set the LCD control pins to their default values.
    //
    GPIOPinWrite(LCD_CS_BASE, LCD_CS_PIN, LCD_CS_PIN);
    GPIOPinWrite(LCD_RS_BASE, LCD_RS_PIN, 0x00);
    GPIOPinWrite(LCD_RD_BASE, LCD_RD_PIN, LCD_RD_PIN);
    GPIOPinWrite(LCD_WR_BASE, LCD_WR_PIN, LCD_WR_PIN);
    GPIOPinWrite(LCD_CS_BASE, LCD_CS_PIN, 0);
    GPIOPinWrite(LCD_IM0_BASE, LCD_IM0_PIN, 0x00);
    //
    // Delay for 1ms.
    //
    SysCtlDelay(ui32ClockMS);

    //
    // Deassert the LCD reset signal.
    //
    GPIOPinWrite(LCD_RESET_BASE, LCD_RESET_PIN, LCD_RESET_PIN);

    //
    // Delay for 1ms while the LCD comes out of reset.
    //
    SysCtlDelay(ui32ClockMS);
}


void TFTLCD_EnterSleep()
{

	WriteCommand(0x07F0); WriteData(0x5420);
	WriteCommand(0x07DE); WriteData(0x0C00);
	WriteCommand(0x07F0); WriteData(0x0000);
	WriteCommand(0x0007); WriteData(0x0000);
	SysCtlDelay(200000);
	WriteCommand(0x0100); WriteData(0x0002);
	SysCtlDelay(200000);
}

