Peyton-Chen/Music-Reminder/TM4C1294XL端/Music_Reminder/TFTinit/TFT_400x240_OTM4001A_16bit.c
void TFTLCD_ExitSleep()
{

	WriteCommand(0x07F0); WriteData(0x5420);
	WriteCommand(0x07DE); WriteData(0x0400);
	WriteCommand(0x07F0); WriteData(0x0000);
	WriteCommand(0x0100); WriteData(0x11B0);
	SysCtlDelay(200000);
	WriteCommand(0x0007); WriteData(0x0173);
	SysCtlDelay(200000);

}




//*****************************************************************************
//
//! Initializes the display driver.
//!
//! \param ui32SysClockSpeed is the system clock speed of the MCU.
//!
//! This function initializes the TFTLCD display controller on the panel,
//! preparing it to display data.
//!
//! \return None.
//
//*****************************************************************************
void
TFT_400x240_OTM4001Ainit(uint32_t ui32SysClockSpeed)
{
    uint32_t ui32ClockMS;

    //
    // Get the current processor clock frequency.
    //
    ui32ClockMS = ui32SysClockSpeed / (3 * 1000);

    //
    // Enable the GPIO peripherals used to interface to the OTM4001A.
    //
    SysCtlPeripheralEnable(LCD_RS_PERIPH);
    SysCtlPeripheralEnable(LCD_RD_PERIPH);
    SysCtlPeripheralEnable(LCD_WR_PERIPH);
    SysCtlPeripheralEnable(LCD_CS_PERIPH);
    SysCtlPeripheralEnable(LCD_RESET_PERIPH);
    SysCtlPeripheralEnable(LCD_IM0_PERIPH);

    //
    // Perform low level interface initialization depending upon how the LCD
    // is connected to the Tiva C Series microcontroller.  This varies
    // depending upon the daughter board connected it is possible that a
    // daughter board can drive the LCD directly rather than via the basic GPIO
    // interface.
    //
    {
        //
        // Initialize the GPIOs used to interface to the LCD controller.
        //
        InitGPIOLCDInterface(ui32ClockMS);
    }

    HWREG(LCD_RESET_PIN_REG) = 0xFF;
    SysCtlDelay(200000);   //Under 120MHz system clock, SysCtlDelay(1000) is about 25us, SysCtlDelay(1) for about 25ns.
    HWREG(LCD_RESET_PIN_REG) = 0;
    SysCtlDelay(400000);
    HWREG(LCD_RESET_PIN_REG) = 0xFF;
    SysCtlDelay(4000000);
    // sleep
//    TFTLCD_EnterSleep();
//======== Power ON sequence============//
    WriteCommand(0x0606);WriteData(0x0000);//Set the order of receiving data when using i80 interface.1st to 2nd
    SysCtlDelay(4000000);
    WriteCommand(0x0007);WriteData(0x0001);//Display Control 1
    SysCtlDelay(200000);
    WriteCommand(0x0110);WriteData(0x0001);
    SysCtlDelay(200000);
    WriteCommand(0x0100);WriteData(0x17B0);
    WriteCommand(0x0101);WriteData(0x0147);
    WriteCommand(0x0102);WriteData(0x019D);
    WriteCommand(0x0103);WriteData(0x3600);
    WriteCommand(0x0281);WriteData(0x0010);
    SysCtlDelay(200000);
    WriteCommand(0x0102);WriteData(0x01BD);
    SysCtlDelay(200000);
//==========================================//
    WriteCommand(0x0000);WriteData(0x0000);
    WriteCommand(0x0001);WriteData(0x0100);

    WriteCommand(0x0002);WriteData(0x0100);
    WriteCommand(0x0003);WriteData(0x00A0);

    WriteCommand(0x0006);WriteData(0x0000);
//    WriteCommand(0x0008);WriteData(0x0503);
    WriteCommand(0x0008);WriteData(0x0202);//Display Control 2

    WriteCommand(0x0009);WriteData(0x0001);//Display Control 3
//    WriteCommand(0x000B);WriteData(0x0010);//Low Power Control
    WriteCommand(0x000B);WriteData(0x0000);//Sam test

    WriteCommand(0x000C);WriteData(0x0000);//External Display Interface Control 1
     	 	 	 	 	 	 	 	 	   //RM = 0,System interface/VSYNC interface
    WriteCommand(0x000F);WriteData(0x0000);//External Display Interface Control 2
    WriteCommand(0x0007);WriteData(0x0001);

                                           //Panel Interface Control 1
    WriteCommand(0x0010);WriteData(0x0013);//Set the clock cycle per line  19

    WriteCommand(0x0011);WriteData(0x0202);// NOWI [2:0]: Set the adjacent gate driver output non-overlap
//    WriteCommand(0x0011);WriteData(0x0301);// SDTI2-0: Set the delay of source output in every line.

    WriteCommand(0x0012);WriteData(0x0300);
    WriteCommand(0x0020);WriteData(0x021E);
    WriteCommand(0x0021);WriteData(0x0202);

    WriteCommand(0x0022);WriteData(0x0100);
    WriteCommand(0x0090);WriteData(0x8000);//Set the position of the frame marker. 0 < FMP < BP + NL + FP
    WriteCommand(0x0092);WriteData(0x8000);
    WriteCommand(0x0100);WriteData(0x16B0);
//    WriteCommand(0x0100);WriteData(0x12B0);
//    WriteCommand(0x0100);WriteData(0x11B0);
    SysCtlDelay(200000);
    WriteCommand(0x0101);WriteData(0x0147);
//    WriteCommand(0x0101);WriteData(0x0027);//Set DC/DC charge pump circuit,Set the voltage of VCI1. VCI1
    WriteCommand(0x0102);WriteData(0x01BE);
//    WriteCommand(0x0102);WriteData(0x018A);//Set the voltage level of VREG1OUT
    SysCtlDelay(200000);
//    WriteCommand(0x0103);WriteData(0x0600);
    WriteCommand(0x0103);WriteData(0x1600);
    SysCtlDelay(200000);
    WriteCommand(0x0107);WriteData(0x0000);
    SysCtlDelay(200000);
    WriteCommand(0x0110);WriteData(0x0001);
    SysCtlDelay(200000);
    WriteCommand(0x0210);WriteData(0x0000);
    WriteCommand(0x0211);WriteData(0x00EF);
    WriteCommand(0x0212);WriteData(0x0000);
   //Window Vertical RAM Address End
    WriteCommand(0x0213);WriteData(0x018F);
    WriteCommand(0x0200);WriteData(0x0000);//tb

    WriteCommand(0x0201);WriteData(0x0000);//tb
    WriteCommand(0x0280);WriteData(0x0000);
//    WriteCommand(0x0281);WriteData(0x0000);
    WriteCommand(0x0281);WriteData(0x0007);

    WriteCommand(0x0282);WriteData(0x0000);
    SysCtlDelay(200000);
    WriteCommand(0x0300);WriteData(0x0002);
    WriteCommand(0x0301);WriteData(0x081D);
    WriteCommand(0x0302);WriteData(0x1621);
    WriteCommand(0x0303);WriteData(0x3D12);
    WriteCommand(0x0304);WriteData(0x3C0B);
    WriteCommand(0x0305);WriteData(0x1004);
    WriteCommand(0x0306);WriteData(0x0A06);
    WriteCommand(0x0307);WriteData(0x0612);
    WriteCommand(0x0308);WriteData(0x0105);
    WriteCommand(0x0309);WriteData(0x0004);
    WriteCommand(0x030A);WriteData(0x0F05);
    WriteCommand(0x030B);WriteData(0x0F00);
    WriteCommand(0x030C);WriteData(0x000F);
    WriteCommand(0x030D);WriteData(0x050F);
    WriteCommand(0x030E);WriteData(0x0106);
    WriteCommand(0x030F);WriteData(0x0406);

