Peyton-Chen/Music-Reminder/TM4C1294XL端/Music_Reminder/TFTinit/TFT_400x240_OTM4001A_16bit.c
    WriteCommand(0x0400);WriteData(0x3500);
    WriteCommand(0x0401);WriteData(0x0001);
    WriteCommand(0x0404);WriteData(0x0000);
    WriteCommand(0x0500);WriteData(0x0000);
    WriteCommand(0x0501);WriteData(0x0000);
    WriteCommand(0x0502);WriteData(0x0000);
    WriteCommand(0x0503);WriteData(0x0000);
    WriteCommand(0x0504);WriteData(0x0000);
    WriteCommand(0x0505);WriteData(0x0000);
    WriteCommand(0x0600);WriteData(0x0000);
    WriteCommand(0x0606);WriteData(0x0000);
    WriteCommand(0x06F0);WriteData(0x0000);
    WriteCommand(0x07F0);WriteData(0x5420);

    WriteCommand(0x07F2);WriteData(0x00DF);
    WriteCommand(0x07F3);WriteData(0x288A);
    WriteCommand(0x07F4);WriteData(0x0022);
    WriteCommand(0x07F5);WriteData(0x0041);
    WriteCommand(0x07F0);WriteData(0x0000);
    WriteCommand(0x0007);WriteData(0x0173);
    SysCtlDelay(200000);
    WriteCommand(0x0007);WriteData(0x0061);
    SysCtlDelay(200000);
    WriteCommand(0x0007);WriteData(0x0173);
    SysCtlDelay(2000000);
    WriteCommand(0x0202);

    // Exit sleep
//    TFTLCD_ExitSleep();
    TFTLCD_CLEAR(0);
}

void TFTLCD_REFRESH_GRAM(uint16_t ui16Data)
{
	WriteData(ui16Data);
}

//================================================================================================
//	实现功能：	设置坐标
//  输入参数：  x0，y0 起始坐标
//         x1，y1 结束坐标
//================================================================================================
void TFTLCD_SetPos(uint32_t x0, uint32_t x1, uint32_t y0, uint32_t y1)
{
    WriteCommand(0x0210);WriteData(x0);
    WriteCommand(0x0211);WriteData(x1);
    WriteCommand(0x0212);WriteData(y0);
    WriteCommand(0x0213);WriteData(y1);
    WriteCommand(0x0200);WriteData(x0);
    WriteCommand(0x0201);WriteData(y0);
    WriteCommand(0x0202);
}

//================================================================================================
//	实现功能：	画点
//  输入参数：  x，y 需要画点坐标
//         color 点的颜色
//================================================================================================
void TFTLCD_DrawPoint(unsigned int x,unsigned int y,unsigned int color)
{
	TFTLCD_SetPos(x,x,y,y);        //设置待画点坐标
	WriteData(color);         //在指定点写入颜色数据
}


//================================================================================================
//	实现功能：	显示Ascii字符
//  输入参数：  x 横坐标
//              y 纵坐标
//		        c 需要显示的字符
//		        fColor 字符颜色
//		        bColor 字符背景颜色
//================================================================================================
void TFTLCD_ShowChar(uint32_t x, uint32_t y, uint32_t chr, uint32_t fColor, uint32_t bColor)
{
	uint32_t i,j;
	uint8_t m;

	chr=chr-' ';//得到偏移后的值
	TFTLCD_SetPos(x,x+8-1,y,y+16-1);                    //设置字符显示位置
	for(i=0; i<16;i++) {                             //循环写入16字节，一个字符为16字节
	  m=asc2_1608[chr][i];  //提取c字符的第i个字节
		for(j=0;j<8;j++) {                        //循环写入8位，一个字节为8位
			if((m&0x80)==0x80) {                  //判断最高位是否为1
				WriteData(fColor);           //最高位为1，写入字符颜色
				}
			else {
				WriteData(bColor);           //最高位为0，写入背景颜色
				;
				}
			m<<=1;                                //左移1位，准备写下一位
			}
		}
}



//显示字符串
//x,y:起点坐标
//*p:字符串起始地址
//用16字体
#define MAX_CHAR_POSX 230
#define MAX_CHAR_POSY 390
void TFTLCD_ShowString(uint32_t x,uint32_t y,char *p,uint32_t fColor, uint32_t bColor)
{

    while(*p!='\0')
    {
        if(x>MAX_CHAR_POSX){x=0;y+=16;}
        if(y>MAX_CHAR_POSY){y=x=0;TFTLCD_CLEAR(bColor);}
        TFTLCD_ShowChar(x,y,*p,fColor,bColor);
        x+=8;
        p++;
    }
}

//================================================================================================
//	实现功能：	TFT清屏
//	输入参数：	bColor 清屏所使用的背景色
//================================================================================================
void TFTLCD_CLEAR(uint32_t bColor)
{
 uint32_t i,j;
 TFTLCD_SetPos(0,240,0,400);//400x240
 for (i=0;i<400;i++)
	{
	   for (j=0;j<240;j++)
		   WriteData(bColor);
	}
}

//================================================================================================
//	实现功能：	用指定颜色填充指定区域
//	输入参数：	x0:横坐标起点,y0:纵坐标起点,x1:横坐标终点,y1:纵坐标终点,color:指定颜色
//================================================================================================
void TFTLCD_FillBlock(uint32_t x0, uint32_t x1, uint32_t y0, uint32_t y1, uint32_t Color)
{
	 uint32_t i,j;
	TFTLCD_SetPos(x0,x1,y0,y1);
	 for (i=y0;i<y1;i++)
		{
		   for (j=x0;j<x1;j++)
			   WriteData(Color);
		}


}

//================================================================================================
//  实现功能：显示一个变量数据 i32Data  -9999<=i32Data<=9999
//  输入参数：变量数字i32Data，    x,y:起点坐标       ,color:指定颜色
//================================================================================================
void TFTLCD_ShowData(uint32_t x,uint32_t y,int32_t i32Data,uint32_t fColor, uint32_t bColor)
{
	char Data[6];
	if(i32Data>9999||i32Data<-9999)
	{
		TFTLCD_ShowString(x,y,"Error:Out of range!",RED,WHITE);
		return;
	}
	if(i32Data < 0)
	{
		Data[0] = '-';
		i32Data = ~i32Data+1;
	}
	else
	{
		Data[0] = ' ';
	}
	Data[1] = i32Data / 1000;
	Data[2] = (i32Data-Data[1]*1000) / 100;
	Data[3] = (i32Data-Data[1]*1000-Data[2]*100) / 10;
	Data[4] = (i32Data-Data[1]*1000-Data[2]*100-Data[3]*10);
	Data[1] += '0';
	Data[2] += '0';
	Data[3] += '0';
	Data[4] += '0';
	Data[5] = '\0';
	TFTLCD_ShowString(x,y,Data,fColor,bColor);
	;
}



//显示一副图片
void TFTLCD_ShowPicture(uint32_t x,uint32_t y,uint8_t gImage[])
{
	uint32_t temp,i,j,m;
	for(i=0;i<120;i++)
	{
		for(j=0;j<240;j++)
		{
			WriteData(0x00);
		}
	}
	for(i=0;i<160;i++)
	{
		for(j=0;j<56;j++)
		{
			WriteData(0x00);
		}
		for(j=0;j<128;j++)
		{
			temp=gImage[m];
			temp |= gImage[m+1]<<8;
			WriteData(temp);
			m++;
			m++;
			}
		for(j=0;j<56;j++)
			{
			WriteData(0x00);
			}
	}
	for(i=0;i<120;i++)
	{
		for(j=0;j<240;j++)
		{
			WriteData(0x00);
		}
	}

}

//================================================================================================
//	实现功能：	画一条水平线
//	输入参数：	x0:横坐标起点,x1:横坐标终点,y:纵坐标,color:指定颜色
//================================================================================================
void TFTLCD_DrawHorizontalLine(uint32_t x0,uint32_t x1,uint32_t y,uint32_t color)
{
	uint32_t i=0,PointNum = 0;
	PointNum = x1-x0;
	for(i=0;i<PointNum;i++)
	{
		TFTLCD_DrawPoint(x0+i,y,color);
	}

