Peyton-Chen/Music-Reminder/TM4C1294XL端/Music_Reminder/TFTinit/TFT_400x240_OTM4001A_16bit.c
}


//================================================================================================
//	实现功能：	画一条垂直线
//	输入参数：	y0:纵坐标起点,y1:纵坐标终点,x:横坐标,color:指定颜色
//================================================================================================
void TFTLCD_DrawVerticalLine(uint32_t y0,uint32_t y1,uint32_t x,uint32_t color)
{
	uint32_t i=0,PointNum = 0;
	PointNum = y1-y0;
	for(i=0;i<PointNum;i++)
	{
		TFTLCD_DrawPoint(x,y0+i,color);
	}

}

//====================================================================================
// 实现功能：   画一条任意的直线
//  输入参数：   y0:纵坐标起点,y1:纵坐标终点,x0:横坐标起点，x1：横坐标起点,color:指定颜色
//=====================================================================================
void TFTLCD_DrawLine(int x1,int y1,int x2,int y2,int color)
{
    int dx,dy,e;
    dx=x2-x1;
    dy=y2-y1;

    if(dx>=0)
    {
        if(dy >= 0) // dy>=0
        {
            if(dx>=dy) // 1/8 octant
            {
                e=dy-dx/2;
                while(x1<=x2)
                {
                    TFTLCD_DrawPoint(x1,y1,color);
                    if(e>0){y1+=1;e-=dx;}
                    x1+=1;
                    e+=dy;
                }
            }
            else        // 2/8 octant
            {
                e=dx-dy/2;
                while(y1<=y2)
                {
                    TFTLCD_DrawPoint(x1,y1,color);
                    if(e>0){x1+=1;e-=dy;}
                    y1+=1;
                    e+=dx;
                }
            }
        }
        else           // dy<0
        {
            dy=-dy;   // dy=abs(dy)


            if(dx>=dy) // 8/8 octant
            {
                e=dy-dx/2;
                while(x1<=x2)
                {
                    TFTLCD_DrawPoint(x1,y1,color);
                    if(e>0){y1-=1;e-=dx;}
                    x1+=1;
                    e+=dy;
                }
            }
            else        // 7/8 octant
            {
                e=dx-dy/2;
                while(y1>=y2)
                {
                    TFTLCD_DrawPoint(x1,y1,color);
                    if(e>0){x1+=1;e-=dy;}
                    y1-=1;
                    e+=dx;
                }
            }
        }
    }
    else //dx<0
    {
        dx=-dx;     //dx=abs(dx)
        if(dy >= 0) // dy>=0
        {
            if(dx>=dy) // 4/8 octant
            {
                e=dy-dx/2;
                while(x1>=x2)
                {
                    TFTLCD_DrawPoint(x1,y1,color);
                    if(e>0){y1+=1;e-=dx;}
                    x1-=1;
                    e+=dy;
                }
            }
            else        // 3/8 octant
            {
                e=dx-dy/2;
                while(y1<=y2)
                {
                    TFTLCD_DrawPoint(x1,y1,color);
                    if(e>0){x1-=1;e-=dy;}
                    y1+=1;
                    e+=dx;
                }
            }
        }
        else           // dy<0
        {
            dy=-dy;   // dy=abs(dy)


            if(dx>=dy) // 5/8 octant
            {
                e=dy-dx/2;
                while(x1>=x2)
                {
                    TFTLCD_DrawPoint(x1,y1,color);
                    if(e>0){y1-=1;e-=dx;}
                    x1-=1;
                    e+=dy;
                }
            }
            else        // 6/8 octant
            {
                e=dx-dy/2;
                while(y1>=y2)
                {
                    TFTLCD_DrawPoint(x1,y1,color);
                    if(e>0){x1-=1;e-=dy;}
                    y1-=1;
                    e+=dx;
                }
            }
        }
    }
}

//==============================================================
/*
 * 画三角
 */
//==============================================================
void TFTLCD_DrawTriangle(){
	TFTLCD_DrawHorizontalLine(70,200,128,GREEN);
	TFTLCD_DrawHorizontalLine(70,200,193,GREEN);
	TFTLCD_DrawVerticalLine(129,193,71,GREEN);
	TFTLCD_DrawVerticalLine(129,193,199,GREEN);
}

//==============================================================
/*
 * 画背景
 */
//==============================================================
void DrawBackground(void){
	uint32_t temp, i, j, m;
	m = 0;
	for(i=0; i<400; i++){
		for(j=0; j<240; j++){
			temp = gImage_1[m];
			temp |= gImage_1[m+1] << 8;
			TFTLCD_DrawPoint(j, i, temp);
			m++;
			m++;
		}
	}
}

//==============================================================
/*
 * 画首页背景
 */
//==============================================================
void DrawFirestBackground(void){
	uint32_t temp, i, j, m;
	m = 0;
	for(i=0; i<400; i++){
		for(j=0; j<240; j++){
			temp = shouye[m];
			temp |= shouye[m+1] << 8;
			TFTLCD_DrawPoint(j, i, temp);
			m++;
			m++;
		}
	}
}
//==============================================================
/*
 * 画图
 */
//==============================================================
void DrawPict(uint32_t x, uint32_t y,int p){
	uint32_t temp, i, j, m;
	m = 0;

	const unsigned char * image;
	switch(p){
		case 5:image=ka1;break;
		case 6:image=ka2;break;
		case 7:image=ka3;break;
		case 8:image=ka4;break;
		case 1:image=jay1;break;
		case 2:image=jay2;break;
		case 3:image=jay3;break;
		case 4:image=jay4;break;
	}
	for(i=y; i<y+100; i++){
		for(j=x; j<x+100; j++){
			temp = image[m];
			temp |= image[m+1] << 8;
			TFTLCD_DrawPoint(j, i, temp);
			m++;
			m++;
		}
	}
}

//==============================================================
/*
 * 画暂停键
 */
//==============================================================
void DrawPauseKey(uint32_t x, uint32_t y){
	uint32_t i;
	for(i=0; i<30; i++){
//		TFTLCD_DrawLine(y+i, x+i, y+50-i, x+i, WHITE);
		TFTLCD_DrawLine(x+i/2, y+i/2, x+i/2, y+30-i/2, WHITE);
	}
}

//==============================================================
/*
 * 画上一首键
 */
//==============================================================
void DrawLastKey(uint32_t x, uint32_t y){
	uint32_t i;
	for(i=0; i<24; i++){
		TFTLCD_DrawLine(x-i/2, y+i/2, x-i/2, y+24-i/2, WHITE);
	}
	TFTLCD_DrawLine(x-(i+1)/2, y, x-(i+1)/2, y+24, WHITE);
}

