Peyton-Chen/Music-Reminder/TM4C1294XL端/Music_Reminder/TFTinit/TFT_400x240_OTM4001A_16bit.c
//==============================================================
/*
 * 画下一首键
 */
//==============================================================
void DrawNextKey(uint32_t x, uint32_t y){
	uint32_t i;
	for(i=0; i<24; i++){
		TFTLCD_DrawLine(x+i/2, y+i/2, x+i/2, y+24-i/2, WHITE);
	}
	TFTLCD_DrawLine(x+(i+1)/2, y, x+(i+1)/2, y+24, WHITE);
}

//==============================================================
/*
 * 画播放键
 */
//==============================================================
void DrawStartKey(uint32_t x, uint32_t y){
	uint32_t i;
	for(i=0; i<3; i++){
		TFTLCD_DrawLine(x+i, y, x+i, y+30, WHITE);
		TFTLCD_DrawLine(x+i+15, y, x+i+15, y+30, WHITE);
	}
}

//==============================================================
/*
 * 画播放键背景
 */
//==============================================================
void DrawKeyBack(void){
	int i,j;

	for(i=40;i<200;i++){
		for(j=290;j<340;j++){
			TFTLCD_DrawPoint(i,j,GRAYBLUE);
		}
	}
}
//==============================================================
/*
 * 清除播放键
 */
//==============================================================
void ClearStartKey(uint32_t x, uint32_t y){
	uint32_t i;
	for(i=0; i<3; i++){
		TFTLCD_DrawLine(x+i, y, x+i, y+30, WHITE);
		TFTLCD_DrawLine(x+i+15, y, x+i+15, y+30, GRAYBLUE);
	}
}

//==============================================================
/*
 * 清除暂停键
 */
//==============================================================
void ClearPauseKey(uint32_t x, uint32_t y){
	uint32_t i;
	for(i=0; i<30; i++){
//		TFTLCD_DrawLine(y+i, x+i, y+50-i, x+i, WHITE);
		TFTLCD_DrawLine(x+i/2, y+i/2, x+i/2, y+30-i/2, GRAYBLUE);
	}
}
void TFTLCD_ShowChar_Chinese(uint32_t x, uint32_t y, uint32_t index, uint32_t fColor, uint32_t bColor)
{
	uint32_t i,j;
	uint8_t m;

	TFTLCD_SetPos(x,x+16-1,y,y+16-1);                    //设置字符显示位置
	for(i=0; i<32;i++) {                             //循环写入16字节，一个字符为16字节
	  m=chinese[index][i];  //提取c字符的第i个字节
		for(j=0;j<8;j++) {                        //循环写入8位，一个字节为8位
			if((m&0x80)==0x80) {                  //判断最高位是否为1
				WriteData(fColor);           //最高位为1，写入字符颜色
				}
			else {
				WriteData(bColor);           //最高位为0，写入背景颜色
				;
				}
			m<<=1;                                //左移1位，准备写下一位
			}
		}
}
